<template>
  <v-layout
    id="slang"
    row
  >
    <v-flex xs12>
      <v-scroll-y-transition mode="out-in">
        <slang-text :slangId="phraseId" />
      </v-scroll-y-transition>
    </v-flex>
    <v-flex xs6>
      # Албанском - Gezuar Vitin e Ri
      # Английском - Happy New Year
      # Арабском - Antum salimoun
      # Ассирийском - Sheta Brikhta
      # Белорусском - З Новым Годам
      # Бенгальском - Shuvo Nabo Barsho
      # Болгарском - Сhestita Nova Godina
      # Валлийском - Blwyddyn Newydd Dda
      # Венгерском - Boldog Ooy Ayvet
      # Вьетнамском - Chuc Mung Tan Nien
      # Гавайском - Hauoli Makahiki Hou
      # Галисийском (Северо-западная Испания) - Bo Nadal e Feliz Aninovo
      # Гаэльском - Bliadhna mhath ur
      # Гонконгском - Sun Leen Fai Lok
      # Греческом - Kenourios Chronos
      # Грузинском - Gilotsavt Aral Tsels
      # Датском - Godt Nytаr
      # Иврите - L’Shannah Tovah
      # Индонезийском - Selamat Tahun Baru
      # Иракском - Sanah Jadidah
      # Ирландском - Bliain nua fe mhaise dhuit
      # Испанском - Feliz Ano Nuevo
      # Итальянском - Felice anno nuovo
      # Камбоджийском - Soursdey Chhnam Tmei
      # Китайском - Xin Nian Kuai Le
      # Корейском - Saehae Bock Mani ba deu sei yo!
      # Корсиканском - Pace e Salute
      # Лаосском - Sabai dee pee mai
      # Литовском - Laimingu Naujuju Metu
      # Македонском - Srekjna Nova Godina
      # Малайском - Selamat Tahun Baru
      # Монгольском - Shine Jiliin Bayariin Mend Hurgeye
      # Немецком - Prost Neujahr
      # Непальском - Nawa Barsha ko Shuvakamana
      # Норвежском - Godt Nyttаr
      # Папуа-Новая Гвинея - Nupela yia i go long yu
      # Польском - Szczesliwego Nowego Roku
      # Португальском - Feliz Ano Novo
      # Румынском - An nou fericit
      # Самоа - Manuia le Tausaga Fou
      # Сербском - Srecna Nova godina
      # Сингальском - Subha Aluth Awrudhak Vewa
      # Словацком - A stastlivy Novy Rok
      # Словенском - Sreeno novo leto
      # Сомали - Iyo Sanad Cusub Oo Fiican
      # Суданском - Warsa Enggal
      # Тайском - Sawadee Pee Mai
      # Тамильском - Eniya Puthandu Nalvazhthukkal
      # Турецком - Yeni Yiliniz Kutlu Olsun
      # Узбекском - Yangi Yil Bilan
      # Украинском – З Новым Роком
      # Урду - Naya Saal Mubbarak Ho
      # Филиппинском - Manigong Bagong Taon
      # Финском - Onnellista Uutta Vuotta
      # Французском - Bonne Annee
      # Хинди - Naye Varsha Ki Shubhkamanyen
      # Хорватском - Srecna Nova godina
      # Чешском - Scastny Novy Rok
      # Шведском - Gott nytt аr
      # Эскимосском - Kiortame pivdluaritlo
      # Эсперанто - Felican Novan Jaron
      # Эстонском - Head uut aastat!
      # Японском - Akimashite Omedetto Gozaimasu
      # На латышском Ar jaunu gadu
      # На карачаево-балкарском - Джангы джыл бла алгъышлайма!
      # На Сербском - СРЕЋНА НОВА ГОДИНА!
      # На венгерском-boldog Uj Evet
      # Немецкий - Frohes Neues Jahr или ein gutes Rutch in Neues Jahr
      # По киргизски - Жаны жылыныздар менен!
      # На молдавском: Cu Anul Nou !
      # На венгерском: Boldog ъj йvet kнvбn !
      # На Болгарском - Честита нова година
      # На Армянском - Shnorhavor Nor Tari
      # На Сербском - Срећна Нова година
      # На украинском - З Новим Роком!
      # По грузински будет - Gilotsavt Ahal Tsels
    </v-flex>
    <v-flex xs6>
      # Абхазский - Сара бара бзия бзой
      # Арабский - Ана ахебек (Ана ахебеки)
      # Адыгейский - Сэ оры плэгун
      # Алтайский - Мэн сэни турар
      # Албанский - Уне дуа ти
      # Амхарский - Афэггерэ антэ
      # Английский - Ай лав ю
      # Армянский - Эс кэс сирумэм
      # Афганский - Ма ди кавэл мина
      # Башкирский - Мин хинэ яратау
      # Белорусский - Я тябэ кахаю
      # Бирманский - Чэна тинго чхи ти (Чумма тинго чхи ти)
      # Болгарский - Аз ти обичам
      # Бурятский - Би шамай дурлаха
      # Венгерский - Серетлек
      # Вьетнамский - Эм йеу ань,ань йеу эм
      # Голландский - Ик хуид ван ю
      # Греческий - С'агапо
      # Грузинский - Ме шен миквархар
      # Датский - Йег элскер дит
      # Дунгайский - Во жыай ни
      # Иврит - Ани охевет отха
      # Идиш - Об дих лыб
      # Индонезийский - Сайя ментьинта коу
      # Испанский - Йо тэ амо
      # Итальянский - Ио тэ амо
      # Кабардино-Черкесский - Сэ уэ лагун
      # Казахский - Мэн сэни жаратам
      # Кара-латыкский - К'тыбытык
      # Киргизский - мен сэни суйу
      # Калмыцкий - Би чи дурта болх
      # Коми - Мэ радэйт тэне
      # Корякский - Гымнан гыччи ылну лынык
      # Кумыкский - Мэн сэни сюйим
      # Китайский - Во ай ни
      # Лакский - На вин хира хун
      # Латвийский - Эс тэви милу
      # Латинский - Эго ту амарэ
      # Литовский - Аш тавес милю
      # Луганда - Нкуквагала
      # Македонский - Яс тэбэ сакам
      # Малагайский - Тиа иануо ао
      # Малайзийский - Аку кунта капада авак
      # Марийский - Мый тыймым ратам
      # Менгрельский - Ма си мныорк
      # Молдавский - Т'юбеск
      # Монгольский - Би танд хайртай
      # Мордовский - Мон вечкан
      # Навахо (дине) - Ка-та-уур-дь
      # Нивхский (гилянский) - Коды моды чмодь
      # Немецкий - Ихь либе дихь
      # Нивхский - Ни чезмудь
      # Норвежский - Ег дэг элски
      # Ненецкий - Мань хамзангав сит
      # Осетинский - Аз даима уварзон
      # Персидский - Ман то эйсч
      # Польский - Я цен кохам
      # Португальский - А мо тэ
      # Румынский - Т'юбеск
      # Сербско-хорватский - Я ту волети
      # Словацкий - Мам тя рад
      # Словенский - Яз ти любити
      # Сомали - Анига ку есель
      # Суахили - Мимикупенда
      # Тагальский - Ако сия умибиг
      # Таджикский - Ман тул нохс метинам
      # Тамильский - Нан уннаи кадалирэн
      # Татарский - Мин синэ яратам
      # Тувинский - Мэн сэни ынакшир
      # Турецкий - Бен сана сэвийорум
      # Узбекский - Мэн сэни севем
      # Украинский - Я тэбе кохаю
      # Удмуртский - Яратыщке мон тонэ
      # Финский - Ракастан синуа
      # Французский - Жэ тэм
      # Ханси - Ина зон ка
      # Хакасский - Мин син хынара
      # Хинди - Мэи тумсей пяр карта хум
      # Чешский - Мам те рад
      # Чувашский - Эп сана йорадап
      # Шведский - Яд эльскар дэй
      # Эвенкийский - Би синэ фйв
      # Эрзянский - Мон тон вечкемс
      # Эсперанто- Ми амас син
      # Эстонский - Ма армастан синд
      # Якутский - Мин эн манмаа
      # Японский - Аната ва дай ску дес
    </v-flex>
    <v-flex xs6>
      Абхазский          2
      Адыгейский         2
      Албанский     1    2
      Алтайский          2
      Амхарский          2
      Английский    1    2
      Арабский      1    2
      Армянский     1    2
      Ассирийский   1
      Афганский          2

      Башкирский         2
      Белорусский   1    2
      Бенгальский   1
      Бирманский         2
      Болгарский    1    2
      Бурятский          2

      Валлийский    1
      Венгерский    1    2
      Вьетнамский   1    2

      Гавайский     1
      Галисийский (Северо-западная Испания) 1
      Гаэльский     1
      Гонконгский   1
      Голландский        2
      Греческий     1    2
      Грузинский    1    2

      Датский       1    2
      Дунгайский         2

      Иврит         1    2
      Идиш               2
      Индонезийский 1    2
      Иракский      1
      Ирландский    1
      Испанский     1    2
      Итальянский   1    2

      Кабардино-Черкесский     2
      Казахский          2
      Кара-латыкский     2
      Карачаево-Балкарский     1
      Калмыцкий          2
      Камбоджийский 1
      Киргизский    1    2
      Китайский     1    2
      Коми               2
      Корейский     1
      Корсиканский  1
      Корякский          2
      Кумыкский          2

      Лакский            2
      Лаосский      1
      Латвийский    1    2
      Латинский          2
      Литовский     1    2
      Луганда            2

      Македонский   1    2
      Малагайский        2
      Малайзийский       2
      Малайский     1
      Марийский          2
      Менгрельский       2
      Молдавский    1     2
      Монгольский   1    2
      Мордовский         2

      Навахо (дине)      2
      Нивхский (гилянский)     2
      Немецкий      1    2
      Непальский    1
      Нивхский           2
      Норвежский    1    2
      Ненецкий           2

      Осетинский         2

      Папуа-Новая Гвинея 1
      Персидский         2
      Польский      1    2
      Португальский 1    2

      Румынский     1    2

      Самоа         1
      Сербский      1
      Сербско-хорватский     2
      Сингальский   1
      Словацкий     1    2
      Словенский    1    2
      Сомали        1    2
      Суахили            2
      Суданский     1

      Тагальский         2
      Таджикский         2
      Тайский       1
      Тамильский    1    2
      Татарский          2
      Тувинский          2
      Турецкий      1    2

      Удмуртский         2
      Узбекский     1    2
      Украинский    1    2
      Урду          1

      Филиппинский  1
      Финский       1    2
      Французский   1    2

      Ханси              2
      Хакасский          2
      Хинди         1    2
      Хорватский    1

      Чешский       1    2
      Чувашский          2

      Шведский      1    2

      Эвенкийский        2
      Эрзянский          2
      Эскимосский   1
      Эсперанто     1    2
      Эстонский     1    2

      Якутский         2
      Японский    1    2
    </v-flex>
  </v-layout>
</template>

<script>
export default {
  name: 'PhraseTranslations',
  components: {
    SlangText: () => import('@/containers/SlangText.vue'),
  },
  computed: {
    phraseId() { return this.$route.params.phraseId; },
  },
};
</script>

<style scoped>

</style>
