<template>
  <v-card
    class="pt-4 mx-auto"
    flat
  >
    <v-card-title>
      <h3 class="headline mb-2">{{ family.name }}</h3>
    </v-card-title>

    <v-divider></v-divider>

    <v-layout
      v-if="family.description"
      tag="v-card-text"
      text-xs-left
      wrap
    >
      <v-flex xs8>
        {{family.description}}
        <v-tabs
          v-model="active"
        >
          <v-tab
            v-for="tab in tabs"
            :key="tab.id"
            ripple
          >
            {{ tab.title }}
          </v-tab>
          <v-tab-item
            v-for="tab in tabs"
            :key="tab.id"
          >
            <v-card flat>
              <v-card-title>{{ tab.title }}</v-card-title>
              <v-card-text>{{ tab.text }}</v-card-text>
            </v-card>
          </v-tab-item>
        </v-tabs>
      </v-flex>
      <v-flex xs4>
        <language-summary :family="family" />
      </v-flex>
    </v-layout>

    <v-divider></v-divider>

    <v-layout
      v-if="family.company"
      tag="v-card-text"
      text-xs-left
      wrap
    >
      <v-flex tag="strong" xs5 text-xs-right mr-3 mb-2>Company:</v-flex>
      <v-flex>{{ family.company.name }}</v-flex>
      <v-flex tag="strong" xs5 text-xs-right mr-3 mb-2>Website:</v-flex>
      <v-flex>
        <a :href="`//${family.website}`" target="_blank">{{ family.website }}</a>
      </v-flex>
      <v-flex tag="strong" xs5 text-xs-right mr-3 mb-2>Phone:</v-flex>
      <v-flex>{{ family.phone }}</v-flex>
    </v-layout>
  </v-card>
</template>

<script>
export default {
  name: 'LanguageFamily',
  components: {
    LanguageSummary: () => import('@/components/LanguageSummary'),
  },
  props: [
    'family',
  ],
  data: () => ({
    active: null,
    tabs: [
      {
        id: 1,
        title: 'Название',
        text: `Термин индоевропейские языки (англ. Indo-European languages) был впервые введён английским учёным
        Томасом Юнгом в 1813 году. В немецкоязычной литературе чаще используется термин индогерманские языки (нем.
        indogermanische Sprachen). Иногда ранее индоевропейские языки назывались «арийскими», однако в настоящее время
        этим термином называется подсемья индоевропейских языков, включающая нуристанскую ветвь и индоиранские языки.`,
      },
      {
        id: 2,
        title: 'История',
        text: `Языки индоевропейской семьи происходят от единого праиндоевропейского языка, носители которого жили,
        вероятно, порядка 5—6 тыс. лет назад. Существует несколько гипотез о месте зарождения праиндоевропейского языка
        (в частности, называют такие регионы, как Восточная Европа, Передняя Азия, степные территории на стыке Европы и
        Азии). С большой вероятностью археологической культурой древних индоевропейцев (или одной из их ветвей) можно
        считать так называемую «ямную культуру», носители которой в III тыс. до н. э. обитали на востоке современной
        Украины и юге России. Эту гипотезу подтверждают генетические исследования, которые указывают, что источником
        как минимум части из индоевропейских языков в Западной и Центральной Европе послужила массивная волна миграции
        носителей ямной культуры с территории причерноморских и поволжских степей приблизительно 4500 лет назад.

        В свою очередь, праиндоевропейский язык, согласно гипотезе Х. Педерсена, развитой В. М. Илличем-Свитычем и
        С. А. Старостиным, входит в ностратическую макросемью языков, среди которой особо сближается с картвельскими
        языками, имеющими, подобно ему, аблаут. Данная позиция, однако, была подвергнута критике различными
        специалистами, считается весьма спорной и её выводы не принимаются многими индоевропеистами и компаративистами,
        которые рассматривают теорию ностратических языков либо как, в худшем случае, полностью ошибочную или как, в
        лучшем случае, просто неубедительную.`,
      },
      {
        id: 3,
        title: 'Прародина',
        text: `Гипотеза о двух прародинах для индоевропейцев на территории Армянского нагорья и в степях Восточной
        Европы была сформулирована Миллером ещё в 1873 году на основании близости индоевропейского праязыка с
        семито-хамитскими и кавказскими языками.

        В 1934 году профессор Эмиль Форрер из Швейцарии высказал мнение, что индоевропейский язык образовался в
        результате скрещивания двух неродственных языков[10]. Н. С. Трубецкой, К. К. Уленбек, О. С. Широков и
        Б. В. Горнунг предполагают, что это скрещивание происходило между языком уральско-алтайского типа и языком типа
        кавказско-семитского.

        Работы Т. В. Гамкрелидзе и В. В. Иванова, вышедшие в 1980—1981 годах, развили мысль о двух прародинах на новом
        научном уровне. Многолетняя работа авторов завершилась изданием обобщающего исследования, посвященного языку,
        культуре и прародине индоевропейцев (Гамкрелидзе, Иванов, 1984). В них аргументировалась мысль об общей
        индоевропейской прародине на территории Армянского нагорья и прилегающих к нему регионах и вторичной прародине
        западных индоевропейцев в черноморско-каспийских степях.

        Согласно гипотезе Т. В. Гамкрелидзе и В. В. Иванова ранее всего из индоевропейской общности выделился
        анатолийский праязык. Произошло это не позднее IV тыс. до н. э. где-то в районе Армянского нагорья. Отсюда
        предки анатолийцев начали движение на запад. Дальнейшему разделению индоевропейской общности предшествовало её
        членение на группы диалектов. В одну из таких групп входили предки италийских, кельтских и тохарских языков, во
        вторую — предки арийского, армянского и греческого языков, а также балтийского, славянского и германского.
        Потом вторая группа распалась ещё на две группы, в одну из которых вошли арийский, армянский и греческий
        праязыки, а во вторую — германский, балтийский и славянский праязыки. Затем, через лингвистически ощутимое
        время, из индоевропейской общности выделился тохарский праязык, носители которого двинулись на Восток и по
        прошествии определённого времени достигли Таримской впадины, где были впоследствии зафиксированы письменными
        источниками. Примерно тогда же отделился и греческий праязык, носители которого, двигаясь на запад, достигли
        Эгеиды и заселили Грецию. Носители арийского праязыка двинулись на восток и заселили степи Евразии, но,
        возможно, часть ариев двигалась в степи через Кавказ. Предки италийских, кельтских, славянских, германских и
        балтийских языков, т. н. древнеевропейцы, двигаясь восточнее Каспия, расселились в степи, образовав там ямную
        культуру. Затем произошла экспансия носителей ямной культуры в лесную зону Европы и индоевропеизация Европы,
        как это и предполагает гипотеза Гимбутас. Армяне же были единственным народом, который далеко от
        индоевропейской прародины не уходил, а, совершив ряд коротких миграций, впоследствии вновь заселил Армянское
        нагорье.

        Индоевропейские миграции должны рассматриваться не как тотальная этническая «экспансия», но как движение в
        первую очередь самих индоевропейских диалектов вместе с определённой частью населения, наслаивающегося на
        различные этносы и передающего им свой язык. Последнее положение показывает несостоятельность гипотез,
        опирающихся в первую очередь на антропологические критерии при этнолингвистической атрибуции археологических
        культур.`,
      },
      {
        id: 4,
        title: 'Состав',
        text: `Индоевропейская семья включает в себя албанский, армянский языки, а также славянскую, балтийскую,
        германскую, кельтскую, италийскую, романскую, иллирийскую, греческую, анатолийскую (хетто-лувийскую), иранскую,
        дардскую, индоарийскую, нуристанскую и тохарскую языковые группы. При этом италийская (если романские не
        считать италийскими), иллирийская, анатолийская и тохарская группы представлены лишь мёртвыми языками.`,
      },
      {
        id: 5,
        title: 'Подробный список индоевропейских языков',
        text: ``,
      },
      {
        id: 6,
        title: 'Индо-хеттские языки',
        text: `<ul>
          <li>Индо-хеттская макросемья в первом варианте</li>
          <li>Индо-хеттская макросемья во втором варианте</li>
        </ul>`,
      },
    ],

  }),
};
</script>

<style scoped>

</style>
